-- Adminer 4.7.8 MySQL dump

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

SET NAMES utf8mb4;



INSERT INTO `business_trips` (`ID`, `Employee`, `City`, `Target`, `Start_Date`, `End_Date`, `Prepaid_Expense`) VALUES
(1,	17,	'Саратов',	'Сертификация Оборудования',	'2011-02-21',	'2011-03-04',	40000),
(2,	17,	'Самара',	'Сертификация Оборудования',	'2011-04-05',	'2011-04-29',	40000),
(3,	17,	'Ростов',	'Сертификация Оборудования',	'2012-06-13',	'2012-06-27',	40000),
(4,	17,	'Краснодар',	'Сертификация Оборудования',	'2013-09-01',	'2013-09-15',	40000),
(5,	17,	'Адлер',	'Сертификация Оборудования',	'2013-12-15',	'2014-01-02',	40000),
(6,	17,	'Санкт-Петербург',	'Сертификация Оборудования',	'2014-02-02',	'2014-02-28',	40000),
(7,	17,	'Магадан',	'Сертификация Оборудования',	'2014-06-13',	'2014-06-30',	40000),
(8,	17,	'Мурманск',	'Сертификация Оборудования',	'2014-08-03',	'2014-08-11',	40000),
(9,	17,	'Севастополь',	'Сертификация Оборудования',	'2014-11-12',	'2014-12-01',	40000),
(10,	17,	'Владивосток',	'Сертификация Оборудования',	'2015-01-29',	'2014-02-28',	40000);


DROP TABLE IF EXISTS `business_trips_report`;
CREATE TABLE `business_trips_report` (
  `ID` bigint NOT NULL AUTO_INCREMENT,
  `Date` date NOT NULL,
  `Purpose_Payment` text NOT NULL,
  `Value` float NOT NULL,
  `Businnes_Trips` bigint NOT NULL,
  PRIMARY KEY (`ID`),
  KEY `Businnes_Trips` (`Businnes_Trips`),
  CONSTRAINT `business_trips_report_ibfk_1` FOREIGN KEY (`Businnes_Trips`) REFERENCES `business_trips` (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

INSERT INTO `business_trips_report` (`ID`, `Date`, `Purpose_Payment`, `Value`, `Businnes_Trips`) VALUES
(1,	'2011-03-04',	'На бытовые расходы',	20000,	1),
(2,	'2011-04-29',	'На бытовые расходы',	20000,	2),
(3,	'2012-06-27',	'На бытовые расходы',	20000,	3),
(4,	'2013-09-15',	'На бытовые расходы',	20000,	4),
(5,	'2014-01-02',	'На бытовые расходы',	20000,	5),
(6,	'2014-02-28',	'На бытовые расходы',	30000,	6),
(7,	'2014-06-30',	'На бытовые расходы',	25000,	7),
(8,	'2014-08-11',	'На бытовые расходы',	15000,	8),
(9,	'2014-12-01',	'На бытовые расходы',	25000,	9),
(10,	'2014-02-28',	'На бытовые расходы',	40000,	10);
-- 2021-03-25 15:20:33